<template>
  <div class="contain">
    <div @click="back" class="goback">&lt;</div>
    <div class="content">
         <h1>法律声明及隐私权政策</h1>
      您的信任对我们非常重要，我们深知个人信息对您的重要性，我们将按法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。鉴此，“开眼”软件平台服务提供者（或简称“我们”、“平台”）制定本《法律声明及隐私权政策》（下称“本政策
      /本隐私权政策”）并提醒您
      本政策适用于本平台。如我们关联公司的产品或服务中使用了平台提供的产品或服务但未设独立法律声明及隐私权政策的，则本政策同样适用于该部分产品或服务。需要特别说明的是，本政策不适用于其他第三方向您提供的服务，也不适用于平台中已另行独立设置法律声明及隐私权政策的产品或服务，您向商户提供的个人信息不适用本政策。
      在使用我们各项产品或服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。一旦您开始使用平台各项产品或服务，即表示您已充分理解并同意本政策。本声明属于《“开眼”软件平台服务协议》不可分割的一部分。
    <h2>  1. 适用范围</h2>
      （1）在您注册平台账号时，您根据平台要求提供的个人注册信息；需要提供账号昵称、头像(如有）和手机号码验证等，提供上述信息并同意协议和本隐私政策后，您可以使用该平台的核心业务功能，包括：浏览“开眼”平台内的内容、发布图片、视频、评论和参与话题讨论等。在您注册该平台账号时，平台是使用手机号码进行实名验证，如您拒绝提供手机号码或进行实名验证，您仍然可以浏览部分平台内的内容，但是无法发布图片、视频、评论和参与话题讨论等信息服务。
      （2）在您使用平台网络服务，或访问平台网页时，平台自动接收并记录的您的浏览器和计算机、应用程序上的信息，包括但不限于您IP地址、应用程序、手机类型、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
      （3）平台通过合法途径从商业伙伴处取得的用户个人数据。
      （4）位置信息：当您开启设备定位功能并使用平台基于位置提供的相关服务时，平台会收集有关您的位置信息。该信息属于敏感信息，拒绝提供该信息，仅会使您无法使用与位置信息相关的功能，但不影响您正常使用该平台的其他功能。
      （5）设备信息：平台会根据您在软件安装及使用中授予的具体权限，接受并记录您所使用的设备相关信息(例如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息），这些信息在用户反馈问题时，我们能更容易定位相关问题，帮助您解决相关问题，如您拒绝提供上述信息，我们可能无法向您及时反馈投诉结果。
      （6）通讯录信息：为了帮助您更好地使用平台的产品或服务，确保您使用平台的服务时能与您认识的人进行联系，如您选择开启导入通讯录功能，平台可能对您联系人的姓名和电话号码进行加密，且仅收集加密后的信息，并不会泄露给第三方。
      （7）图片/相机：您发布视频或图片信息时，平台会请求您授权相机、照片、麦克风等敏感权限，您如果拒绝授权提供，将无法使用此功能，但不影响您正常浏览该平台内的内容和其他功能。
      （8）从第三方获取您的个人信息：当您主动使用第三方账号登录该平台时，此时您可选择授权开眼再符合相关法律和法规的前提下读取您在第三方平台上登录、公布、记录的公开信息（包括但不限于昵称、头像等）。对于平台要求但第三方无法提供的个人信息，平台仍可以要求您补充提供，平台可能从第三方获取您的上述信息的目的是为了记住您做为平台用户的登录身份，并向您提供个性化推荐，以便于平台向您提供更优质的产品服务。
     <h2> 您了解并同意，以下信息不适用本隐私权政策：</h2>
      （9）您在使用平台提供的搜索服务时输入的关键字信息；
      （10）平台收集到的您所发布的有关信息数据，包括但不限于参与活动、成交信息等；
      （11）违反法律规定或违反平台规则行为及平台已对您采取的措施。
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    back() {
      this.$router.go(-1);
      console.log("1");
    },
  },
};
</script>
<style scoped>
.contain {
  width: 100%;
  height: 640px;
  overflow-y: scroll;
}
.goback {
  position: absolute;
  z-index: 999;
  transform: rotate(0deg);
  color: black;
  font-size: 0.8rem;
  text-align: center;
  line-height: 1rem;
  width: 1rem;
  height: 1rem;
  border-radius: 1rem;
  cursor: pointer;
}
h1 {
  font-weight: 600;
  font-size: 0.5rem;
  text-align: center;
}
h2 {
  font-weight: 600;
  font-size: 0.38rem;
}
.contain .content {
  width: 80%;
  margin: 30px auto;
}
</style>