<template>
  <div class="contain">
       <div @click="back" class="goback">&lt;</div>
    <div class="content">
      <h1>“开眼”软件用户协议</h1>
      <h2>一、用户协议的接受</h2>
      1.1本用户协议（简称“协议”）系由您与北京牡蛎柠檬科技文化有限公司（以下简称“牡蛎柠檬”）所订立的相关权利义务规范，用以描述牡蛎柠檬通过“开眼”软件向您提供服务及您使用“开眼”软件服务所涉及的详细规定。因此，请您于开始使用“开眼软件”前，切实详细地阅读本协议的所有内容。
      1.2
      只要您开始使用牡蛎柠檬提供的“开眼”软件，即表示您已无条件接受了本协议的相关规定及牡蛎柠檬就此公布的各项管理规定，并愿意受其约束。如果发生纠纷，您应自行承担事实上未认真阅读本条款的责任，不得以未仔细阅读为由进行抗辩。阅读本协议的过程中，如果用户不同意本协议或其中任何条款约定，用户应立即停止注册程序。
      <h2>二、服务内容 2.1</h2>
      “开眼”软件是牡蛎柠檬提供的一款视频软件，牡蛎柠檬通过“开眼”软件向广大用户提供每日精选视频推荐及链接服务（以下简称“牡蛎柠檬服务”）。
      2.2
      除非另有明确约定，“开眼”软件增强或强化目前服务功能的所有新功能，包括新的产品以及新的服务，均自动适用本协议的约定。
      2.3
      牡蛎柠檬向您提供免费服务和收费服务。在提供收费服务前，牡蛎柠檬会向您给予明确提示，只有在您根据提示指示选择同意支付相关费用后，牡蛎柠檬才会向您提供该等收费服务。如果您拒绝支付相关费用，牡蛎柠檬有权不向您提供该等收费服务。
      2.4
      您应当自行负担使用牡蛎柠檬服务所需的设备（例如个人手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费。
      <h2>三、用户账号 3.1</h2>
      您在“开眼”软件进行注册时，须提供真实、有效的身份识别资料，并应在前述资料发生变更时，及时进行线上更新。若您所提供的资料与事实不符或所提供的资料业已变更而未更新或有任何误导之嫌而导致牡蛎柠檬无法为您提供或继续提供服务的，您应自行承担由此引发的损失而与牡蛎柠檬无关。
      3.2
      您须了解和认可，开眼账号的使用权仅归属于原始注册人。未经牡蛎柠檬的事先书面同意，您不得以任何形式将自身开眼账号及密码转让、赠予、出借、售卖予第三方或者以其他方式许可非初始注册人对其进行使用，否则牡蛎柠檬有权封禁、删除该账号。如您并非当前所使用开眼账号的原始注册人，您应立即停止对该账号的一切使用及操作，同时牡蛎柠檬有权依原始注册人之请求或依自身判断将该账号重新交予原始注册人使用，由此引发的全部责任及损失与牡蛎柠檬无关。
      3.3
      您有义务妥善保管在注册时获得的账号及密码，如因黑客、第三人行为或您自身保管疏忽导致账号、密码遭他人非法使用并给您造成损失的，牡蛎柠檬就此不承任何责任。
      3.4
      如您发现自身账号遭他人非法使用或有异常使用的情形，应立即通知牡蛎柠檬，并提供与原始注册人相一致的个人有效身份信息。牡蛎柠檬在核实您所提供的个人有效身份信息后，将尽可能为您维护自身合法权利提供必要协助，但牡蛎柠檬并不承诺您一定能通过该途径找回开眼账号。
     <h2> 四、使用规则 4.1</h2>
      您应就自身使用牡蛎柠檬服务的行为负责，并保证在使用牡蛎柠檬服务的过程中遵循以下原则：
      （1）遵守中国有关的法律和法规；
      （2）遵守本条款及牡蛎柠檬发布的相关管理规定；
      （3）不得以任何形式侵犯第三方及牡蛎柠檬的合法利益；
      （4）不得将牡蛎柠檬提供的服务用于任何非法或侵权活动，包括但不限于将其用于展示、传播包含色情、种族主义、低级趣味、淫秽、诽谤中伤、污辱性质的资料，以及传播任何针对宗教、民族传统、人种、性别、年龄的各种仇恨、歧视和偏见的内容。
      4.2
      牡蛎柠檬有权对您使用服务的情况进行审查和监督，如牡蛎柠檬根据自身独立判断认为您存在违法或违约行为的，有权要求您纠正相应行为，并采取一切必要的措施（包括但不限于更改或删除您发布或上传的内容、暂停或终止您使用牡蛎柠檬服务的权利等）以减轻您行为造成的影响。但您确认，牡蛎柠檬的审查行为并不为其设置任何责任，也不免除您的任何义务。
      4.3
      您应保证自身对“开眼”软件的使用行为的合法性、正当性，且不得对客户端进行反编译、反汇编、破解等行为。
      4.4
      请勿滥用或干扰开眼软件服务，包括但不限于将开眼软件服务用于非法目的，篡改与开眼软件相关的计算机代码，使用与牡蛎柠檬、开眼相关的标志或文字，攻击牡蛎柠檬的服务器，删除、隐藏或修改任何与开眼软件服务相关的声明等。
      4.5
      您了解并认可，在您使用牡蛎柠檬服务公开发表内容(例如评论)时，须遵守社会公序良德和相关法律法规，且不得发布和上传如下内容：
      （1）违反宪法确定的基本原则的 （2）违反我国法律、法规及其它规定的
      （3）违背社会公序良俗，有损社会公共利益的
      （4）侵害第三方合法权益的文件或信息，包括但不限于病毒代码、黑客程序、软件破解注册信息等
      （5）未获合法授权的文章、图片、音乐、视频、应用等 （6）广告内容或链接
      （7）违反牡蛎柠檬信息发布政策或损害牡蛎柠檬合法权益的 4.6
      牡蛎柠檬有权对您发布和上传的内容进行审核，如牡蛎柠檬根据自身独立判断认为您所发布、上传的内容包含前述情况的，有权直接删除相关内容，且无需另行通知您。您在此确认，牡蛎柠檬的审核行为并不为其设置任何义务，也不能免除您的任何责任。
      4.7 由于您发布上传的内容带来的法律纠纷或其它后果，需要由您自行承担。 4.8
      您在使用牡蛎柠檬过程中创作内容所包含的权利将依法归您自行所有。但您应了解，对于您通过牡蛎柠檬服务发布、上传至可公开获取区域的任何内容，均视为您已同意授权牡蛎柠檬获得相应内容在全世界范围内免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。
      4.9
      如果牡蛎柠檬根据自身独立判断认为您对牡蛎柠檬的使用超出了合理范围，我们有权对您就牡蛎柠檬服务的使用进行限制，您应自行承担由此引发的责任及损失。
      4.10
      您应保证其在注册时和提交订单时所提供的姓名（名称）、联系方式、联系地址等全部信息真实、完整、准确，并当上述信息发生变更时及时进行更新提供给
      “开眼”软件的信息。 4.11 您不得以虚构事实等方式恶意诋毁 “开眼”软件的名誉。
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    back() {
      this.$router.go(-1);
      console.log("1");
    },
  },
};
</script>
<style scoped>
.contain {
  width: 100%;
  height: 640px;
  overflow-y: scroll;
}
.goback {
  position: absolute;
  z-index: 999;
  transform: rotate(0deg);
  color: black;
  font-size: 0.8rem;
  text-align: center;
  line-height: 1rem;
  width: 1rem;
  height: 1rem;
  border-radius: 1rem;
  cursor: pointer;
}
h1 {
  font-weight: 600;
  font-size: 0.5rem;
}
h2 {
  font-weight: 600;
  font-size: 0.4rem;
}
.contain .content {
  width: 80%;
  margin: 30px auto;
}
</style>