<template>
  <div class="contain">
       <div @click="back" class="goback">&lt;</div>
    <div class="content">
  <h1>  “开眼”软件权利声明</h1>
“开眼”软件是北京牡蛎柠檬科技文化有限公司（以下简称“牡蛎柠檬”）提供的一款视频软件，向广大用户提供每日精选视频推荐及链接服务。
<h2>1、</h2> 在使用开眼软件前，请您务必仔细阅读并透彻理解本声明，包括其中对牡蛎柠檬责任的免除或限制条款，以及对您的权利限制条款。您可以选择不使用该功能，但如果您使用该功能，您的使用行为将被视为对本声明全部内容的认可，并同意接受本声明全部条款的约束。您在使用中若有违反本声明的相关规定，牡蛎柠檬有权终止您的开眼软件使用资格被并保留追究相关法律责任的权利。
<h2>2、</h2>牡蛎柠檬对开眼软件（包括但不限于软件中包含的数据和程序、代码、文档、界面实际、图表）中所包含的受知识产权或其他法律保护的资料享有相应的权利；除视频内容的版权由作者依法享有外，开眼软件的整体内容版权归牡蛎柠檬所有。牡蛎柠檬所有和享有的知识产权，不因任何使用行为而发生转移。
<h2>3、</h2>使用开眼软件并不会使您获得或拥有任何属于我们或第三方的知识产权。开眼软件中链接的视频作品的所有权利均属于作者，请勿传播、复制、改编、修改或以其他方式不当使用他人视频作品，包括但不限于转载、链接、下载、复制、编辑、修改、变更、上传、分享、发行、表演、衍生其他作品、创作衍生品、诋毁、破坏作品技术保护措施等。
<h2>4、</h2>牡蛎柠檬已经对开眼软件内全部正版授权的视频内容，采取了必要的反盗版和防盗链等技术措施，并且添加、设置权利管理电子信息。任何单位或个人，未经牡蛎柠檬的许可，不得以任何方式（包括但不限于：盗链、冗余盗取等）直接或间接地盗取相关视频内容、不得以任何方式（包括但不限于：隐藏或者修改开眼软件、开眼相关标识等）删除或者改变相关视频内容的权利管理电子信息。否则，牡蛎柠檬将保留进一步追究侵权者法律责任的权利。
<h2>5、</h2>开眼软件所提供的视频内容均来自于第三方网站，我们对其中任何内容的合法性、准确性、完整性和可靠性概不负责，亦不承担任何法律责任，亦不对该等链接到的内容作出任何明示或默示的保证，包括但不限于有关所有权、质量、没有侵犯第三方权利、没有病毒的保证。
<h2>1</h2>牡蛎柠檬将以最大努力维护开眼软件正常运行，但您应对使用开眼软件的结果自行承担风险，牡蛎柠檬对此不做任何承诺或保证，不保证服务不中断，不保证您所浏览的视频内容的安全性、准确性、完整性、合法性及可靠性，不保证第三方网站是否对其所提供的视频作品均拥有合法、有效、完整的知识产权，对您的数据损失、丢失或服务停止不承担任何责任，由于网络带宽、手机（或其他电子设备）硬件限制等任何原因造成您无法正常使用开眼软件，牡蛎柠檬不承担任何法律责任。
<h2>1</h2>牡蛎柠檬及其服务器并不存储、控制、编辑或删除被链接的第三方网页上登载、存储、编辑、显示的视频内容，以及改动视频内容的网络地址。在视频内容详情页面，牡蛎柠檬会提示该视频内容的作者、来源网站等信息。
    </div>
  </div>
</template>
<script>
export default {
  methods: {
    back() {
      this.$router.go(-1);
      console.log("1");
    },
  },
};
</script>
<style scoped>
.contain {
  width: 100%;
  height: 640px;
  overflow-y: scroll;
}
.goback {
  position: absolute;
  z-index: 999;
  transform: rotate(0deg);
  color: black;
  font-size: 0.8rem;
  text-align: center;
  line-height: 1rem;
  width: 1rem;
  height: 1rem;
  border-radius: 1rem;
  cursor: pointer;
}
h1 {
  font-weight: 600;
  font-size: 0.5rem;
}
h2 {
  font-weight: 600;
  font-size: 0.4rem;
}
.contain .content {
  width: 80%;
  margin: 30px auto;
}
</style>